const initialState = {
  text: "با توجه به ابلاغ 'ستاد ملی مبارزه با کرونا' جهت اجرای طرح فاصله گذاری هوشمند، وزارت بهداشت، درمان و آموزش پزشکی ضمن حمایت از فعالیت اصناف و صنایع با اولویت صیانت از سلامت کارکنان و مشتریان، و همچنین جلوگیری از شیوع و گسترش بیماری کرونا اقدام به راه اندازی 'سامانه ثبت نام اصناف و صنایع 'کرده است. لذا مدیران، متصدیان، مالکان و کارفرمایان محترم موظفند به منظور شروع فعالیت با رعایت نکات بهداشتی اعلام شده در راهنماهای گام دوم مبارزه با کووید-19 (فاصله گذاری اجتماعی) ؛ در این سامانه ثبت نام و اطلاعات مربوط به کارگاه/امکنه کاری، نوع فعالیت و اطلاعات تماس (برابر راهنما) اقدام نموده تا مجوز شروع فعالیت صنف و یا صنعت مربوطه برابر مقررات صادر گردد. نکته: عدم ثبت نام در این سامانه منجر به عدم صدورمجوز فعالیت و یا در صورت فعالیت موجب توقف فعالیت کارگاه/امکنه کاری مربوطه خواهد شد. * راهنماهای گام دوم مبارزه با کووید-19، فاصله گذاری اجتماعی و الزامات سلامت محیط کار، شاغلین و مشتریان با توجه به نوع فعالیت پس از تکمیل ثبت نام بصورت الکترونیکی ابلاغ می گردد.",
};

export default function guide(state = initialState, action) {
  let { type, data } = action;
  switch (type) {
    default:
      return state;
  }
}
